app/views/posts/index.html.erb


			<p><a href="/bright_ideas/<%=post.id%>"><%= post.LikedPost.count %> likes</a></p>
---
SELECT "posts".* FROM "posts"
SELECT COUNT(*) FROM "liked_posts" WHERE "liked_posts"."post_id" = $1  [["post_id", 4]]