app/views/posts/show.html.erb

<tbody>
	<% @post.LikedPost.each do |p| %>
---
SELECT "liked_posts".* FROM "liked_posts" WHERE "liked_posts"."post_id" = $1  [["post_id", 4]]