app/views/posts/show_user.html.erb

	<h3>Total Number of Posts: <%= @post.count %></h3>
	<h3>Total Number of Likes: <%= @post.first.LikedPost.count %></h3>
---
SELECT "posts".* FROM "posts" WHERE (user_id = 1)
SELECT COUNT(*) FROM "liked_posts" WHERE "liked_posts"."post_id" = $1  [["post_id", 4]]