app/controllers/posts_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts"
---
	def index
		@user = User.find(session[:user_id])
		@posts = Post.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "posts" ("user_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["content", "test\r\n"], ["created_at", 2016-12-20 04:51:30 UTC], ["updated_at", 2016-12-20 04:51:30 UTC]]
---
	def create
		@user = User.find(session[:user_id])
		post = Post.new(content: post_params[:content], user:@user)
		if post.save

DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 4]]
---
	def destroy
		post = Post.destroy(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
	def show
		@user = User.find(session[:user_id])
		@post = Post.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE (user_id = 1)
---
	def show_user
		@user = User.find(params[:id])
		@post = Post.where("user_id = ?", @user.id).to_a

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "posts" SET "like_id" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["like_id", 1], ["updated_at", 2016-12-20 06:22:59 UTC], ["id", 4]]
INSERT INTO "liked_posts" ("user_id", "post_id", "liker_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["post_id", 4], ["liker_id", 1], ["created_at", 2016-12-20 06:25:48 UTC], ["updated_at", 2016-12-20 06:25:48 UTC]]
---
	def create_like

		@user = User.find(session[:user_id])
		post = Post.find(params[:id]).update(like:@user)
		p = Post.find(params[:id])
		liked_post = LikedPost.create(user: p.user, post: Post.find(params[:id]), liker: User.find(session[:user_id]))