app/controllers/sessions_controller.rb

	def create
		#valid credentials
		user = User.find_by(email:login_params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "ant@gmail.com"], ["LIMIT", 1]]